INSERT INTO hall
VALUES
(1, 'Большой', 500),
      (2, 'Малый', 150);



INSERT INTO troup
VALUES (1, 'Балет'),
       (2, 'Опера'),
       (3, 'Балет');


INSERT INTO actor
VALUES (1, 1, 'Абрамова Елена Андреевна'),
         (2, 1,	'Кораблев Илья Иванович'),
         (3, 1,	'Лисенкова Елизавета Андреевна'),
         (4, 2,	'Сапожников Ярослав Владимирович'),
         (5, 2,	'Иванова Татьяна Павловна'),
         (6, 2,	'Мамедова Лейла Али-Агаевна'),
         (7, 3,	'Макулов Андрей Сергеевич'),
         (8, 3,	'Грачев Антон Сергеевич'),
         (9, 3,	'Адеева Светлана Васильевна'),
         (10, 3, 'Маскалева Екатерина Владимировна')
;

INSERT INTO performance
VALUES (1,	'Балет "Щелкунчик"',	'2021-04-24',	'19:00',	2,	2,	'Доступно к покупке'),
(2,	'Балет "Щелкунчик"',	'2021-05-13',	'20:00',	2,	1,	'Недоступно к покупке'),
(3,	'Балет "Лебединое озеро"',	'16.06.2021',	'19:00',	1, 2,	'Недоступно к покупке'),
(4,	'Балет "Лебединое озеро"',	'19.03.2021',	'19:00',	3, 1,	'Архив')
;

INSERT INTO sector
VALUES (1, 'Амфитеатр', 1, 150),
       (2, 'Амфитеатр', 2, 70);

INSERT INTO ticket
VALUES (1, 1800, 1, 2, 1, true),
       (2, 1800, 1, 2, 2, true);

